core/app/Http/Controllers/SiteController.php

    public function index()
    {
        $reference = @$_GET['reference'];
        if ($reference) {
            session()->put('reference', $reference);
        }

        $pageTitle   = 'Home';
        $sections    = Page::where('tempname', activeTemplate())->where('slug', '/')->first();
---
select * from `pages` where `tempname` = 'templates.basic.' and `slug` = '/' limit 1

    public function pages($slug)
    {
        $page        = Page::where('tempname', activeTemplate())->where('slug', $slug)->firstOrFail();
---
select * from `pages` where `tempname` = 'templates.basic.' and `slug` = 'login' limit 1