core/app/Traits/ContactManager.php

    public function list()
    {
        $user = getParentUser();
        $contactTags = ContactTag::where('user_id', $user->id)->orderBy('name')->get();
        $baseQuery = Contact::where('user_id', $user->id)
            ->with('lists', 'tags', 'conversation')
            ->searchable(['mobile', 'firstname', 'lastname'])
            ->orderBy('id', 'desc');

        $tagId = request()->tag_id;

        if ($tagId) {
            $baseQuery->whereHas('tags', function ($q) use ($tagId) {
                $q->where('contact_tags.id', $tagId);
            });
        }
        if ($this->module == 'customer') {
            $baseQuery->where('is_customer', Status::YES);
        }

        $contactLists = ContactList::where('user_id', $user->id)->orderBy('name')->get();
---
select * from `contact_tags` where `user_id` = 1 order by `name` asc
select * from `contact_lists` where `user_id` = 1 order by `name` asc

            $validContacts[] = $cleanNumber;

            // DB check
            $exists = Contact::where('user_id', $user->id)
                ->where(function ($q) use ($cleanNumber) {
                    $q->where('mobile', $cleanNumber)
                        ->orWhereRaw("CONCAT(mobile_code, mobile) = ?", [$cleanNumber]);
                })->exists();
---
select exists(select * from `contacts` where `user_id` = 1 and (`mobile` = '923423233668' or CONCAT(mobile_code, mobile) = '923423233668')) as `exists`

            $contact->mobile = $cleanNumber;
            $contact->mobile_code = "";

            $contact->save();
---
insert into `contacts` (`user_id`, `firstname`, `lastname`, `mobile`, `mobile_code`, `updated_at`, `created_at`) values (1, 'Group Member', '3668', '923423233668', '', '2026-02-02 10:03:17', '2026-02-02 10:03:17')