core/app/Http/Helpers/helpers.php

function decrementFeature($user, $feature, $count = 1)
{
    if (!Schema::hasColumn('users', $feature)) {
        return;
    }

    if ($user->$feature == Status::UNLIMITED) return;

    $user->decrement($feature, $count);
---
update `users` set `contact_limit` = `contact_limit` - 1, `users`.`updated_at` = '2026-02-01 01:22:51' where `id` = 1