core/app/Http/Helpers/helpers.php

select * from `extensions` where `act` = 'google-analytics' and `status` = 1 limit 1
---
function loadExtension($key)
{
    $extension = Extension::where('act', $key)->where('status', Status::ENABLE)->first();

select * from `languages` where `code` = 'en' limit 1
---
function getCurrentLangImage()
{
    $language = Language::whereCode(getCurrentLang())->first();

select * from `frontends` where `tempname` = 'basic' and `data_keys` = 'kyc.content' order by `id` desc limit 1
select * from `frontends` where `tempname` = 'basic' and `data_keys` = 'policy_pages.element' order by `id` asc
---
function getContent($dataKeys, $singleQuery = false, $limit = null, $orderById = false)
{

    $templateName = activeTemplateName();
    if ($singleQuery) {
        $content = Frontend::where('tempname', $templateName)->where('data_keys', $dataKeys)->orderBy('id', 'desc')->first();
    } else {
        $article = Frontend::where('tempname', $templateName);
        $article->when($limit != null, function ($q) use ($limit) {
            return $q->limit($limit);
        });
        if ($orderById) {
            $content = $article->where('data_keys', $dataKeys)->orderBy('id')->get();

select * from `general_settings` limit 1
---
function gs($key = null)
{
    $general = Cache::get('GeneralSetting');

update `users` set `contact_limit` = `contact_limit` - 1, `users`.`updated_at` = '2026-02-02 10:03:17' where `id` = 1
---
function decrementFeature($user, $feature, $count = 1)
{
    if (!Schema::hasColumn('users', $feature)) {
        return;
    }

    if ($user->$feature == Status::UNLIMITED)
        return;

    $user->decrement($feature, $count);